Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: །དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་བར་དག་ནས་ཀྱང་བརྒྱ་བྱིན་ཐེར་འབུམ་དང་། ལྷའི་བུ་རབ་འཐབ་བྲལ་ཐེར་འབུམ་དང་། ཡོངས་སུ་དགའ་ལྡན་ཐེར་འབུམ་དང་། འཕྲུལ་དགའ་ཐེར་འབུམ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཐེར་འབུམ་དང་།
en: In the same way, a billion Śakras, a billion Suyāmas, a billion Saṃtuṣitas, a billion Sunirmitas, a billion Para­nirmitavaśavartins, a billion asura lords, a billion Māras, and a billion Brahmās in the billion worlds of this billion-world universe came through the power of the Bhagavat to this four-continent world.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཐེར་འབུམ་དང་། བདུད་ཐེར་འབུམ་དང་། ཚངས་པ་ཆེན་པོ་ཐེར་འབུམ་དག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་མཐུས་ཚངས་པ་ཆེན་པོའི་བར་དུ་རེ་རེ་ཞིང་ཡང་ཚངས་རིས་ཀྱི་ལྷ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མའི་བར་དག་གིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་བཅོམ་ལྡན་འདས་དང་།
en: Each great Brahmā was accompanied by a following of many hundreds of thousands of millions of trillions of Brahmā-realm devas and their retinues, who had developed the aspiration for the highest, most complete enlightenment.

source: དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྲད་པར་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། བཅོམ་ལྡན་འདས་ལས་ཆོས་མཉན་པའི་ཕྱིར་གླིང་བཞི་པ་འདིར་ལྷགས་སོ།
en: They came to see the Bhagavat and his saṅgha of bhikṣus, to pay homage to them, honor them, and listen to the Dharma from the Bhagavat. And also it was so for all the other deva lords.

source: །དེའི་ཚེ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དག་ཀྱང་ཁྱབ་པར་མ་གྱུར་པའི་ས་ཕྱོགས་དེ་ནི་ཅུང་ཟད་ཀྱང་མེད་དོ།
en: At that time, there was nowhere in the billion-world universe where this had not occurred. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་འདི་སྙམ་དུ་སེམས་ཏེ། གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བདག་གི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཞིང་། ཇི་ལྟར་རྣམ་ཐོས་ཀྱི་བུ་ཐེར་འབུམ་དང་། ཚངས་པ་ཆེན་པོ་ཐེ་འབུམ་གྱི་བར་འདི་དག་བདག་དང་འཐུན་པར་འཇུག་པ་དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱང་བདག་དང་འཐུན་པར་མཛད་པ་ལྟ་ན། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་གྱི་མི་དང་།
en: Noble son, the brahmin Samudrareṇu then thought, ‘If my aspiration for the highest, most complete enlightenment is to be fulfilled, then just as the billion Vaiśravaṇas and so on, up to and including the billion great Brahmās, complied with my request, may the Bhagavat also comply with my request.

source: དུད་འགྲོ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པ་དང་། སེམས་ཅན་དམྱལ་བ་དེ་དག་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་གྱི་ཚོར་བ་རབ་ཏུ་ཞི་བར་མཛད་ལ་བདེ་བའི་ཚོར་བ་སྐྱེད་ནས་དེ་དག་རེ་རེའི་མདུན་ན་ཡང་སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་བཞུགས་ཤིང་དེས་སེམས་ཅན་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོ་འཕྲུལ་ཆེན་པོ་མཛད་པར་གྱུར་ཅིག་སྙམ་མོ།
en: May he perform a great miracle and bring to an end the suffering of all humans, all animals, those in the realm of Yama, and all hell beings in this billion-world universe. May he bring them bliss, and may he make an emanated buddha appear before each one to make them aspire to the highest, most complete enlightenment.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས་དེའི་ཚེ་ཏིང་ངེ་འཛིན་རབ་ཏུ་གདུང་བ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་སོ། །འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ཏིང་ངེ་འཛིན་རབ་ཏུ་གདུང་བ་ལ་ཐུགས་མཉམ་པར་བཞག་པས།
en: Noble son, the tathāgata arhat samyaksam­buddha Ratnagarbha knew the thought that had arisen in the brahmin Samudrareṇu’s mind.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལས་སྤུའི་ཁུང་བུ་རེ་རེ་ནས་ཀྱང་འོད་ཟེར་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་སྙེད་དག་བྱུང་སྟེ།
en: The Bhagavat entered the samādhi called splendor, and countless light rays shone from each of his pores.

source: འོད་ཟེར་དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཁྱབ་པར་གྱུར་ཏོ།
en: Those light rays spread throughout the billion-world universe.

source: །དེ་ལ་འོད་ཟེར་ཁ་ཅིག་ནི་སེམས་ཅན་དམྱལ་བར་དོང་ནས་གྲང་བའི་སེམས་ཅན་དམྱལ་བར་སྐྱེས་པའི་སེམས་ཅན་རྣམས་ལ་རླུང་དྲོན་པོ་དག་ལངས་སོ། །གང་དག་ཚ་བའི་སེམས་ཅན་དམྱལ་བར་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་ལ་ནི་རླུང་བསིལ་བ་དག་ལངས་ཏེ།
en: Some light rays went to the hells, where they became warm breezes that blew on the beings in the cold hells, and cool breezes that blew on the beings in the hot hells.

source: དེས་སེམས་ཅན་དམྱལ་བའི་སེམས་ཅན་དེ་དག་གི་བཀྲེས་པ་དང་། སྐོམ་པ་དང་། ངལ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱས་ནས་བདེ་བའི་ཚོར་བ་བསྐྱེད་དོ།
en: The light rays caused the beings in hell to cease experiencing the suffering of hunger, thirst, and fatigue, and instead to experience bliss. “

source: །སེམས་ཅན་དམྱལ་བ་པ་རེ་རེའི་མདུན་ན་ཡང་སངས་རྒྱས་ཀྱི་སྤྲུལ་པའི་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྐུ་བརྒྱན་ཅིང་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་གཟུགས་ལེགས་པར་སྤྲས་པ་བཞུགས་སོ།
en: In front of each being in hell there was an emanated buddha adorned with the thirty-two signs and eighty excellent features of a great being.

source: །དེ་ནས་སེམས་ཅན་དམྱལ་བ་པ་བདེ་བ་དང་ལྡན་པ་དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ། རྐྱེན་གང་གིས་བདག་ཅག་གི་སྡུག་བསྔལ་རབ་ཏུ་ཞི་ཞིང་བདེ་བ་སྐྱེས་པར་གྱུར་སྙམ་པ་དང་།
en: When those beings in hell experienced bliss they wondered, ‘What has caused our suffering to cease and bliss to arise?’

source: དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་རྣམ་པར་མཛེས་པ་དེ་མཐོང་ངོ་། །དེ་དག་གིས་དེ་མཐོང་ནས་འདི་སྐད་དུ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་བདག་ཉིད་ཆེན་པོ་འདིའི་མཐུས་བདག་ཅག་འདི་ལྟར་བདེ་བར་གྱུར་ཏོ་ཞེས་ཟེར་ཞིང་དེ་དག་དགའ་བ་དང་།
en: When they saw the body of the Bhagavat adorned with the thirty-two signs and eighty excellent features of a great being, they said, ‘It is through the power of this embodiment of great compassion that we have become blissful.’ “

source: བདེ་བ་སྐྱེས་ནས་རབ་ཏུ་དང་བའི་ཡིད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་།
en: Glad and joyful, they gazed at the Bhagavat with complete trust.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་འདི་སྐད་ཅེས་སེམས་ཅན་དག་ཁྱེད་ཅག་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ལེགས་པར་ཚིག་ཏུ་བརྗོད་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་ཅིག་དང་།
en: The Bhagavat said to them, ‘Beings, you should recite the words “homage to the Buddha!” and develop the aspiration for the highest, most complete enlightenment.

source: ཁྱེད་ཅག་ཕྱིས་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བར་མི་འགྱུར་ཞིང་རྟག་ཏུ་བདེ་བའི་ཚོར་བ་འདི་ལྟ་བུ་དག་འཐོབ་པར་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་པ་དང་།
en: If you do so, you will never experience suffering but will always have this kind of bliss.’ “

source: དེ་དག་གིས་ཀྱང་འདི་སྐད་ཅེས་བདག་ཅག་སངས་རྒྱས་ལ་ཕྱག་འཚལ་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཀྱིས་དགེ་བའི་རྩ་བ་དེས་བདག་ཅག་གི་ལས་ཀྱི་སྒྲིབ་པ་ཟད་པར་གྱུར་ཅིག་ཅེས་སྨྲས་སོ།
en: They said, ‘May our good roots from reciting “homage to the Buddha” and developing the aspiration for the highest, most complete enlightenment cause our karmic obscurations to cease!’

source: །དེ་ནས་ཁ་ཅིག་ཤི་འཕོས་ནས་ཀྱང་མི་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་སོ།
en: Then some of them passed away and had fortunate human rebirths. “

source: །སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་གང་དག་མེས་སྲེག་པ་དེ་དག་ལ་ཡང་འོད་ཟེར་དེ་དག་གིས་རླུང་བསིལ་བ་དག་རབ་ཏུ་བཏང་སྟེ།
en: The light rays became cold winds that blew on those who were burning in the fires of the hot hells.

source: དེ་དག་གིས་དེ་དག་ལ་རེག་པ་དང་བཀྲེས་པ་དང་། སྐོམ་པ་རབ་ཏུ་ཞི་ཞིང་སྡུག་བསྔལ་མེད་པར་གྱུར་ནས།
en: When the light rays touched those beings, they were freed from the sufferings of hunger and thirst.

source: ཁ་ཅིག་དེ་ནས་ཤི་འཕོས་ནས་མི་རྣམས་དང་། སྐལ་བ་མཉམ་པར་སྐྱེས་པའི་བར་དུ་གྱུར་ཏོ།
en: Some of them passed away and were reborn as humans. “

source: །དེ་བཞིན་དུ་དུད་འགྲོའི་སྐྱེ་གནས་རྣམས་ལ་ཡང་བརྗོད་པར་བྱའོ། །དེ་བཞིན་དུ་མི་རྣམས་ཀྱི་བར་ལ་ཡང་བརྗོད་པར་བྱའོ།
en: The same happened in the animal realm and the same happened for humans.

source: །འོད་དེ་ཡང་ཕྱིར་ལོག་སྟེ་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་པ་ལྷ་དང་།
en: That light then returned to the Bhagavat, circled him three times, and was absorbed into his uṣṇīṣa.

source: མི་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཀླུ་དང་། ལྷ་མ་ཡིན་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་གིས་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་གནས་པར་གྱུར་ཏོ།
en: The countless devas, humans, yakṣas, rākṣasas, nāgas, and asuras who saw this were established in irreversible progress toward the highest, most complete enlightenment.

source: །སེམས་ཅན་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་དག་གིས་ཀྱང་ཏིང་ངེ་འཛིན་དང་། བཟོད་པ་དང་། གཟུངས་ཐོབ་པར་གྱུར་ཏོ།
en: Countless beings attained samādhi, dhāraṇī, and acceptance.

source: །འཛམ་བུའི་གླིང་གི་མི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་གྱི་ཆེད་ཀྱི་ཕྱིར་ལྷ་རྣམས་ཀྱིས་རྒྱལ་པོའི་ཕོ་བྲང་གྲོང་ཁྱེར་ཡིད་འོང་འཛིན་གྱི་འཛམ་བུའི་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་ལྷའི་རྒྱན་དང་།
en: The humans in Jambudvīpa heard that devas had adorned with divine adornments and banners the Jambūvana Park in the king’s palace in the beautiful city in honor of the Bhagavat and his saṅgha of bhikṣus.

source: ལྷབ་ལྷུབ་དག་གིས་བརྒྱན་ཏོ་ཞེས་ཐོས་ནས་བདག་ཅག་དོང་སྟེ་བལྟ་ཞིང་དེར་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་དང་། དགེ་སློང་གི་དགེ་འདུན་ཡང་བལྟའོ།
en: They said, ‘We should go there to see it and to see the Tathāgata Ratnagarbha and his saṅgha of bhikṣus.

source: །དེར་སོང་ནས་བཅོམ་ལྡན་འདས་ལས་ཆོས་ཀྱང་མཉན་པར་བྱའོ་ཞེས་སྨྲས་ནས། དེའི་ཚེ་ན་མི་རྣམས་ལས་སྐྱེས་པ་དང་།
en: When we are there, we should listen to the Dharma from the Bhagavat.’ “

source: བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་།
en: At that time, many hundreds of thousands of millions of trillions of human men, women, girls, and boys came each day to the delightful city because they desired to see Jambūvana, and to see, pay homage to, and honor the Bhagavat and his saṅgha of bhikṣus, and to hear the Dharma from the Bhagavat. “

source: ཕྲད་པར་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། སྐྱེད་མོས་ཚལ་དེ་ཡང་མཐོང་བར་འདོད་པའི་ཕྱིར་ཉིན་གཅིག་བཞིན་དུ་གྲོང་ཁྱེར་ཡིད་འོང་འཛིན་དུ་འོང་ངོ་། །སྐྱེད་མོས་ཚལ་དེ་ལ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པའི་སྒོ་ཉི་ཁྲི་ཡོད་དེ།
en: That parkland had twenty thousand gates made of the seven jewels, and at each of the parkland’s gates five hundred precious seats had been arranged.

source: སྐྱེད་མོས་ཚལ་གྱི་སྒོ་རེ་རེ་ཞིང་རིན་པོ་ཆེའི་ཁྲིའུ་ལྔ་བརྒྱ་ལྔ་བརྒྱ་བཤམས་ནས་དེ་དག་ལ་བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱ་ལྔ་བརྒྱ་འཁོད་ནས་སེམས་ཅན་གང་དག་འོངས་ཤིང་སྐྱེད་མོས་ཚལ་དེར་འཇུག་པ་དེ་དག་བྲམ་ཟེའི་ཁྱེའུ་དེ་དག་གིས་སངས་རྒྱས་ལ་སྐྱབས་སུ་གཏོང་། ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་གཏོང་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་སྟེ། འཛུད་ཅིང་སེམས་ཀྱང་སྐྱེད་དུ་འཇུག་གོ།
en: At each of those places, five hundred brahmin youths were seated, and those young brahmins would tell whoever came to enter that parkland that they should take refuge in the Buddha, the Dharma, and the Saṅgha, and they instructed them to focus on and develop the aspiration for the highest, most complete enlightenment. “

source: །གང་དག་ཉེ་བ་ན་གནས་པ་རྣམས་དང་། གང་དག་རིང་བ་ན་གནས་པ་རྣམས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་ཡང་བལྟ་བའི་ཕྱིར། ཕྱིས་སྐྱེད་མོས་ཚལ་དེར་འཇུག་གོ།
en: Those who were dwelling nearby and afar entered the parkland in order to see and pay homage to the Bhagavat, to see the saṅgha of bhikṣus, and to hear the Dharma from the Bhagavat.

source: །དེ་ལྟར་མདུན་ན་འདོན་གྱི་གཙོ་བོ་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་ལོ་བདུན་པོ་དེ་དག་ལས་ལྷ་བགྲང་བ་ལས་འདས་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ་བཏུལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ། །ཀླུ་དང་། ལྷ་མ་ཡིན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། གྲུལ་བུམ་དང་།
en: For seven years, in that way, the brahmin Samudrareṇu, the principal court priest, instructed countless devas to develop the aspiration for the highest, most complete enlightenment, and he trained, guided, and established them in it.

source: དྲི་ཟ་དང་། ཡི་དགས་དང་། ཤ་ཟ་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་སུ་སྐྱེས་བ་བགྲང་བ་ལས་འདས་པའི་བར་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་བཅུག་སྟེ་བཏུལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་དོ།
en: He also instructed countless nāgas, asuras, yakṣas, rākṣasas, kumbhāṇḍas, gandharvas, pretas, piśācas, hell beings, and animals to develop the aspiration for the highest, most complete enlightenment, and he trained, guided, and established them in it. “

source: །བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་དེ་ལོ་བདུན་པོ་དེ་དག་འདས་ནས་ཀྱང་ལྷའི་འཁོར་ལོ་རིན་པོ་ཆེ་མ་གཏོགས་པར་འཁོར་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། གླང་པོ་རིན་པོ་ཆེ་མ་གཏོགས་པ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྒྱན་གྱིས་བརྒྱན་པའི་གླང་པོ་ཆེ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། ཤིང་རྟ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དག་ཀྱང་འབུལ་བར་འདོད་དོ། །རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ཀྱང་ལོ་བདུན་པོ་དེ་དག་འདས་འདས་སུ་འདོད་ཆགས་ལ་འདུན་པ་མ་སྐྱེས་སོ། །ཞེ་སྡང་ལ་འདུན་པ་མེད།
en: After seven years had passed, the brahmin Samudrareṇu wished to offer, with the exception of the divine precious wheel, 84,000 wheels, and, with the exception of the precious elephant, 84,000 elephants adorned by the seven jewels, and so on, up to and including 84,000 chariots. “

source: གཏི་མུག་ལ་འདུན་པ་མེད། རྒྱལ་སྲིད་ལ་འདུན་པ་མེད། ནོར་ལ་འདུན་པ་མེད། བུ་ལ་འདུན་པ་མེད། བུ་མོ་ལ་འདུན་པ་མེད། ཟས་ལ་འདུན་པ་མེད། སྐོམ་ལ་འདུན་པ་མེད། གོས་ལ་འདུན་པ་མེད། སྤོས་ལ་འདུན་པ་མེད། བཞོན་པ་ལ་འདུན་པ་མེད།
en: King Araṇemin, during those seven years, had no interest in desire, interest in anger, interest in stupidity, interest in kingdoms, interest in wealth, interest in sons, interest in daughters, interest in food, interest in drink, interest in clothes, interest in incense, interest in carriages, interest in sleep, interest in himself, or interest in others.

source: གཉིད་ལ་འདུན་པ་མེད། བདག་ཏུ་འདུན་པ་མེད། གཞན་དུ་འདུན་པ་མེད་པར་གྱུར་ཏོ། །ལོ་བདུན་དུ་གློས་ཕབ་སྟེ་ཉལ་བར་མ་གྱུར་ཀྱང་།
en: For seven years he did not lie down on his side.

source: དེ་ལ་མཚན་མོའི་འདུ་ཤེས་མ་སྐྱེས། ཉིན་མོའི་འདུ་ཤེས་མ་སྐྱེས་སོ། །གཟུགས་ཀྱི་འདུ་ཤེས་མ་ཡིན། སྒྲའི་འདུ་ཤེས་མ་ཡིན། དྲིའི་འདུ་ཤེས་མ་ཡིན།
en: He had no conception of night, no conception of day, no conception of form, no conception of sound, no conception of smell, no conception of taste, and no conception of touch.

source: རོའི་འདུ་ཤེས་མ་ཡིན་ཏེ། རེག་བྱའི་འདུ་ཤེས་ཀྱང་མ་སྐྱེས་སོ། །ལོ་བདུན་དུ་དེ་དག་གིས་ལུས་ལ་ངལ་བ་མ་སྐྱེས་ཏེ།
en: For seven years he had no physical fatigue.

source: རྟག་པར་རྒྱུན་དུ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་མཐོང་ཡང་དེའི་མིག་ལམ་དུ་རི་རབ་སྣང་བར་མ་གྱུར།
en: He was always and continuously seeing the arrays of buddha-realm qualities in worlds in the ten directions that were as numerous as the particles in a thousand buddha realms. His eyes did not perceive Sumeru.

source: རི་གཞན་དག་ཀྱང་མ་ཡིན། ཁོར་ཡུག་ཀྱང་མ་ཡིན། ཁོར་ཡུག་ཆེན་པོ་དག་ཀྱང་མ་ཡིན། འཇིག་རྟེན་གྱི་བར་དག་ཀྱང་མ་ཡིན། ཉི་མ་དང་ཟླ་བ་དག་ཀྱང་མ་ཡིན་ཏེ།
en: His eyes did not perceive other mountains, the Cakravāḍa and Mahācakravāḍa mountains, the regions between the worlds, the sun and the moon, or the palaces of the devas.

source: ལྷའི་གཞལ་མེད་ཁང་དག་ཀྱང་མིག་ལམ་དུ་སྣང་བར་མ་གྱུར་ཅིང་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དེ་དག་མཐོང་བ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པའི་ཡོན་ཏན་བཀོད་པ་དག་ལ་ལྟ་ཞིང་སྨོན་ལམ་སེམས་པར་བྱེད་དོ།
en: As he beheld those completely pure buddha realms, he gazed upon and prayed in his mind for the arrays of qualities of those completely pure buddha realms. “

source: །ཇི་ལྟར་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་དེ་ལྟ་བུའི་བདེ་བའི་ཡོན་ཏན་གྱི་གནས་པས་ལོ་བདུན་དུ་གནས་པ་དང་། དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་མཐོང་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པའི་ཡོན་ཏན་བཀོད་པའི་སྨོན་ལམ་སེམས་ཤིང་འདུག་པ་དེ་བཞིན་དུ་རྒྱལ་བུ་ཐུ་བོ་མིག་མི་འཛུམས་དང་། མུ་ཁྱུད་དང་།
en: King Araṇemin remained for seven years in a state of bliss, seeing the array of qualities of the buddha realms, and praying in his mind for the array of qualities of a completely pure buddha realm.

source: དབང་པོའི་ཚོགས་དང་། དེ་བཞིན་དུ་རྒྱལ་བུ་སྟོང་པོ་དེ་དག་ཐམས་ཅད་དང་། ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། གཞན་ཡང་སྲོག་ཆགས་དུང་ཕྱུར་ཕྲག་དགུ་དང་། བྱེ་བ་ཕྲག་གཉིས་པོ་ཐམས་ཅད་ཀྱང་དེ་ལྟར་ལོ་བདུན་དུ་གཅིག་པུ་དབེན་པར་སོང་སྟེ་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་ནས།
en: In the same way, the crown prince Animiṣa, Nimi, Indragaṇa, all the thousand princes, the 84,000 minor kings, and 920,000,000 other beings also stayed in solitary retreat for seven years.

source: ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་ཀྱང་མཐོང་ལ།
en: They saw in each of the ten directions realms as numerous as the particles in a thousand buddha realms.

source: ལོ་བདུན་གྱི་བར་དུ་དེ་དག་འདོད་ཆགས་ལ་འདུན་པ་མ་སྐྱེས་ཤིང་། ཞེ་སྡང་ལ་འདུན་པ་མེད། གཏི་མུག་ལ་འདུན་པ་མེད། དེ་དག་ལ་ངལ་བའི་གནས་སྐྱེས་པར་མ་གྱུར་པའི་བར་དུ་སྟེ།
en: For seven years they had no attraction to desire or anger, no attraction toward stupidity, and so on, up to and including having no fatigue. “

source: རྟག་པར་རྒྱུན་དུ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གི་རྡུལ་ཕྲ་རབ་སྙེད་དག་མཐོང་ཡང་དེ་དག་གི་མིག་ལམ་དུ་རི་རབ་ཀྱང་སྣང་བར་མ་གྱུར།
en: They were constantly, continuously seeing in each of the ten directions the arrays of qualities of buddha realms as numerous as the particles in a thousand buddha realms. Their eyes did not perceive Sumeru.

source: རི་གཞན་དག་ཀྱང་མ་ཡིན། ལྷའི་གཞལ་མེད་ཁང་གི་བར་དག་ཀྱང་མིག་ལམ་དུ་སྣང་བར་མ་གྱུར་ཏེ།
en: Their eyes did not perceive other mountains and so on, up to and including not perceiving the palaces of the devas.

source: དེ་དག་གིས་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་དག་མཐོང་བ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པའི་ཡོན་ཏན་བཀོད་པའི་སྨོན་ལམ་སེམས་ཤིང་ཐམས་ཅད་ཀྱང་ཡོན་ཏན་གྱི་གནས་པ་དེ་ལྟ་བུས་ལོ་བདུན་དུ་གནས་ཏེ།
en: As they beheld those completely pure buddha realms, they thus prayed in their minds for those arrays of qualities of completely pure buddha realms. They all spent seven years delighting in those qualities. “

source: ཁ་ཅིག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པའི་ཡོན་ཏན་བཀོད་པ་དག་སེམས་སོ།
en: Some contemplated the arrays of qualities of pure buddha realms.

source: །ཁ་ཅིག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མ་དག་པའི་ཡོན་ཏན་བཀོད་པ་དག་སེམས་སོ།
en: Some contemplated the arrays of qualities of impure buddha realms. “

source: །དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་ལོ་བདུན་པོ་དེ་དག་ཐལ་ཞིང་རྫོགས་པར་རིག་ནས་རིན་པོ་ཆེ་སྣ་བདུན་འབུལ་བར་འདོད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་ནས།
en: When the brahmin Samudrareṇu knew that the seven years had passed and were over, he wished to make an offering of the seven kinds of jewels. Therefore, he placed his palms together, bowed toward the tathāgata arhat samyaksam­buddha Ratnagarbha, and said to the Bhagavat, ‘Bhadanta Bhagavat, I have caused King Araṇemin to aspire to the highest, most complete enlightenment.

source: དེ་རང་གི་ཁྱིམ་དུ་མཆིས་ཏེ། གཅིག་པུ་དབེན་པར་མཆིས་ནས་ནང་དུ་ཡང་དག་འཇོག་ལ་གནས་ཤིང་དེར་མི་སུ་ཡང་མཆིར་མི་སྟེར་ལགས་སོ།
en: He is in his own home, on retreat, alone in solitude, and no one is allowed to enter.

source: །དེ་བཞིན་དུ་བདག་གིས་རྒྱལ་བུ་སྟོང་པོ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་ཅིང་གཟེངས་བསྟོད་ནས་དེ་བཞིན་དུ་སོ་སོ་རང་རང་གི་ཁྱིམ་དག་ཏུ་མཆིས་ཏེ། གཅིག་པུ་ནང་དུ་ཡང་དག་འཇོག་ལ་གནས་ཤིང་། དེར་ཡང་སུ་ཡང་མཆིར་མི་སྟེར་ལགས་སོ། །དེ་བཞིན་དུ་ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། དེ་བཞིན་དུ་གཞན་ཡང་སྲོག་ཆགས་དུང་ཕྱུར་ཕྲག་དགུ་དང་།
en: In the same way, I have caused the 84,000 minor kings and 920,000,000 other beings to acquire, enter, and remain in the aspiration for the highest, most complete enlightenment.

source: བྱེ་བ་ཕྲག་གཉིས་ཀྱི་བར་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་ཅིང་བཙུད་དེ་རབ་ཏུ་བཀོད་ནས་ཐམས་ཅད་ཀྱང་རང་རང་གི་ཁྱིམ་དག་ཏུ་མཆིས་ཏེ། གཅིག་པུ་དབེན་པར་མཆིས་ནས་ནང་དུ་ཡང་དག་འཇོག་ལ་གནས་ཤིང་དེར་ཡང་སུ་ཡང་མཆིར་མི་སྟེར་ལགས་ན། བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་ཀྱང་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ནང་དུ་ཡང་དག་འཇོག་དེ་ལས་ལངས་ཏེ་འདིར་མཆི་བར་འགྱུར་བ་དང་།
en: They went to their own homes where they are on retreat, alone in solitude, and no one is allowed to enter.

source: གང་དག་བདག་གིས་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་སྩལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་འདིར་མཆི་བར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་བློས་མི་གཡོ་བ་འཛིན་པར་འགྱུར་བ་དང་། བཅོམ་ལྡན་འདས་ལས་ལུང་བསྟན་པ་འཐོབ་པར་འགྱུར་བ་དང་། མིང་དང་། རུས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་དེ་དག་ལ་དགོངས་སུ་གསོལ།
en: I request the Bhagavat to have King Araṇemin and all those whom I have caused to aspire to enlightenment to leave their retreats and come here so that they can develop unwavering aspiration for the highest, most complete enlightenment and receive from the Bhagavat the prophecies of their names, families, and buddha realms.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོ་ཏིང་ངེ་འཛིན་བློ་གྲོས་སྒྲུབ་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་སོ།
en: Then, noble son, the tathāgata arhat samyaksam­buddha Ratnagarbha entered the samādhi called accomplishment of intelligence.

source: །དེ་ལྟར་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པས་ཞལ་ནས་འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། བཙོད་ཁ་དང་།
en: As he rested in that samādhi, blue, yellow, red, white, crimson, crystal, and silver light rays came from his mouth.

source: ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ངོ་། །དེ་དག་བྱུང་ནས་ཀྱང་ནང་དུ་ཡང་དག་འཇོག་ལ་གནས་པ་དེ་དག་གི་མདུན་དུ་ཚངས་པར་སྤྲུལ་ཏེ་འདུག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དག་ལོངས་ཤིག །
en: Each light ray manifested as the deity Brahmā in front of each of those who were on retreat, saying, ‘Friends, get up.

source: བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་ལོ་བདུན་དུ་མཆོད་སྦྱིན་བྱ་བ་ནི་ཟིན་ཏེ།
en: The brahmin Samudrareṇu has completed his seven years of offerings.

source: བཅོམ་ལྡན་འདས་ཀྱང་གཞན་དུ་རྒྱུ་ཞིང་གཤེགས་པར་འགྱུར་གྱིས།
en: The Bhagavat is going to leave and go elsewhere.

source: གྲོགས་པོ་དག་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་དེང་ཤིག །
en: Friends, go to see, pay homage to, and serve the Bhagavat and his saṅgha of bhikṣus.’ “

source: དེ་ནས་དེ་དག་ཐམས་ཅད་ལ་འོད་ཟེར་དེ་དག་གིས་བསྐུལ་བ་དང་།
en: Exhorted by those light rays, they left their retreats.

source: ལངས་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་ལ་སྐུལ་བར་བྱེད་དོ།
en: The light rays also exhorted King Araṇemin, who also left his retreat to see the Bhagavat.

source: །དེ་ཡང་དེ་དག་གིས་བསྐུལ་བ་དང་། ལངས་ཏེ་ཆས་སོ། །རྒྱལ་པོ་དེ་ཆས་པ་དང་ལྷ་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ནས་རྔ་བོ་ཆེ་དང་། རྫ་རྔ་དང་། རྔ་པ་ཊ་ཧ་ལ་སོགས་པ་རོལ་མོའི་སྒྲ་དག་ཀྱང་རབ་ཏུ་བསྒྲགས་སོ།
en: As he did so, the devas in the sky played bherī,mṛḍaṅga,paṭaha, and other drums. “

source: །དེ་ནས་རྒྱལ་པོ་རྩིབས་ཀྱི་མུ་ཁྱུད་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། བཅོམ་ལྡན་འདས་ལ་བསྙེན་བཀུར་བྱ་བའི་བར་གྱི་ཕྱིར་ཤིང་རྟ་ལ་ཞོན་ནས་བུ་སྟོང་པོ་དེ་དག་དང་། ཁམས་ཀྱི་རྒྱལ་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་། སྲོག་ཆགས་དུང་ཕྱུར་ཕྲག་དགུ་དང་། བྱེ་བ་ཕྲག་གཉིས་པོ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ནས་གྲོང་ཁྱེར་ནས་བྱུང་སྟེ་བཅོམ་ལྡན་འདས་ཀྱི་དྲུང་དུ་སོང་ངོ་།
en: In order to see the Bhagavat, and so on, up to and including honoring him, King Araṇemin mounted his carriage and, accompanied and attended by the thousand princes, the 84,000 minor kings, and the 920,000,000 other beings, he began his journey to the Bhagavat.

source: །དེ་བཞོན་པས་བགྲོད་པའི་ས་ཇི་སྲིད་པ་དེ་སྲིད་དུ་བཞོན་པས་སོང་ནས་བཞོན་པ་ལས་བབས་སོ།
en: He traveled by carriage for as far as there was ground for a carriage to travel on, and then he descended from the carriage.

source: །བཞོན་པ་ལས་བབས་ནས་རྐང་པས་འཛམ་བུའི་ཚལ་དུ་ཞུགས་སོ། །ཞུགས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་།
en: After descending from the carriage, he entered the park on foot.

source: བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་གྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། སྲོག་ཆགས་བྱེ་བ་ཕྲག་དུ་མ་དག་དང་བཅས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: He bowed his head to the feet of the Bhagavat and his saṅgha of bhikṣus and then sat to one side along with many millions of beings. “
